cf_billing/Documents/энргУстановитьТехническийСтатусТочкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьТехническийСтатусТочкиУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргУслугиТочекУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатусыТочекУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекущееСостояние</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредыдущееСостояние</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПомещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКатегорииПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиктивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргУстановитьТехническийСтатусТочкиУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;		
	КонецЕсли;
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДокумент=Ложь; 
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда 
		ЗаполнитьДокумент=Истина;
	КонецЕсли;
	
	Если ЗаполнитьДокумент тогда 
		ЗаполнитьСтатусыТочекУчетаНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		
		ЗаполнитьСтатусыТочекУчетаНаСервере();
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		
		Объект.СтатусыТочекУчета.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
		
		ЗаполнитьСтатусыТочекУчетаНаСервере();
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		
		Объект.СтатусыТочекУчета.Очистить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	
	Если НЕ Помещение.Пустая() Тогда
		ЗаполнитьСтатусыТочекУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.Организация.Пустая() Тогда
		Объект.СтатусыТочекУчета.Очистить();
	Иначе
		ЗаполнитьСтатусыТочекУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
		
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличныхЧастей

&НаКлиенте
Процедура СтатусыТочекУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыТочекУчетаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "СтатусыТочекУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВспомогательныеМетоды

&НаСервере
Процедура ЗаполнитьСтатусыТочекУчетаНаСервере()
	
	Объект.СтатусыТочекУчета.Очистить();
	
	Если Объект.Организация.Пустая() ИЛИ Объект.Район.Пустая() ИЛИ Объект.КлючПомещения.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыгрузки = энргРаботаСТочкамиУчетаСервер.УслугиИТехническаяТочекУчета(Объект.Организация, Объект.Район, Объект.КлючПомещения);	
	
	Для каждого Строка Из РезультатВыгрузки Цикл
		НСтр = Объект.СтатусыТочекУчета.Добавить();
		НСтр.ТочкаУчета = Строка.ТочкаУчета;
		НСтр.Услуга = Строка.Услуга;
		НСтр.ТекущееСостояние = Строка.Техническая;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти
